#+TITLE: Analysis
#+STARTUP: overview indent
#+OPTIONS: toc:nil
#+LaTeX_CLASS_OPTIONS: [a3paper,10pt]
#+LATEX_HEADER: \usepackage[margin=2cm,a4paper,bottom=1cm]{geometry}
#+EXPORT_EXCLUDE_TAGS: noexport
#+TAGS: noexport(n)

#+PROPERTY: header-args :tangle "analysis-workers.R" :tangle-mode (identity #o755) :shebang "#!/usr/bin/Rscript"

C-c C-v b

* Compute some imbalance metrics

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
df.totals |>
#  filter(case == "default") |>
#  filter(nodes == 1) |>
#  filter(granularity == 5) |>
#  filter(repetition == 2) |>
  group_by(case, nodes, granularity, repetition) |>
  summarize(imbalance.time = max(duration) / mean(duration),
            percent.imbalance = (max(duration)/mean(duration) - 1) * 100,
            imbalance.percentage = ((max(duration) - mean(duration)) / max(duration)) * n() / (n() - 1),
            std.deviation = sqrt(sum((duration - mean(duration))**2) / (n() - 1)),
            .groups="keep") |>
  print() |>
  ggplot(aes(x = repetition, y = imbalance.percentage, color = as.factor(nodes))) +
  geom_point() +
  facet_grid(case~granularity) +
  meu_estilo() +
  theme(legend.position = "top")
#+end_src

#+RESULTS:
#+begin_example
# A tibble: 1,080 × 8
# Groups:   case, nodes, granularity, repetition [1,080]
   case    nodes granularity repetition imbalance.time percent.imbalance
   <chr>   <dbl>       <dbl>      <dbl>          <dbl>             <dbl>
 1 default     1           5          1           1.00             0.270
 2 default     1           5          2           1.00             0.196
 3 default     1           5          3           1.00             0.275
 4 default     1           5          4           1.00             0.441
 5 default     1           5          5           1.00             0.267
 6 default     1           5          6           1.00             0.273
 7 default     1           5          7           1.00             0.205
 8 default     1           5          8           1.00             0.475
 9 default     1           5          9           1.00             0.337
10 default     1           5         10           1.00             0.334
# ℹ 1,070 more rows
# ℹ 2 more variables: imbalance.percentage <dbl>, std.deviation <dbl>
# ℹ Use `print(n = ...)` to see more rows
#+end_example



